<? if (!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die(); ?>
</main>
<footer>
  <div class="cookie">
    <div class="cookie-text">
      Сайт использует файлы cookie, сервисы сбора технических данных посетителей и средства «Яндекс.Метрика».
      Продолжение пользования сайтом является согласием на применение данных технологий.
    </div>
    <div class="cookie-btns">
      <a href="javascript:void(0)" class="arrow-btn__light cookie-more" data-modal-target="#cookie-modal">
        <span>
          Подробнее
        </span>
      </a>
      <a href="javascript:void(0)" class="arrow-btn__dark cookie-agreed">
        <span>
          Понятно
        </span>
      </a>
    </div>
  </div>
  <div class="modal cookie-modal" id="cookie-modal">
    <div class="modal-inner">
      <div class="modal-content">
        <div class="modal-text">
          <b>Об использовании персональных данных</b><br />
          1. При использовании информации, размещенной на Сайте, технические средства сайта автоматически распознают
          сетевые (IP) адреса и доменные имена каждого пользователя информации.<br />
          Упомянутые сведения и электронные адреса лиц, пользующихся интерактивными сервисами Сайта и (или)
          отправляющих электронные сообщения в адреса, указанные на Сайте, сведения о том, к каким страницам Сайта
          обращались пользователи информации, и иные сведения (в том числе персонального характера), сообщаемые
          пользователями информации, хранятся с использованием программных и технических средств Сайта для целей,
          перечисленных в пункте 2 настоящего уведомления.<br />
          2. Сведения о пользователях информации, накапливаемые и хранимые в технических средствах Сайта, используются
          исключительно для целей совершенствования способов и методов представления информации на Сайте, улучшения
          обслуживания пользователей информации, выявления наиболее посещаемых страниц и интерактивных сервисов Сайта,
          а также ведения статистики посещений Сайта.<br />
          3. Вне пределов, указанных в пункте 2 настоящего уведомления, информация о пользователях информации не может
          быть каким-либо образом использована или разглашена. Доступ к таким сведениям имеют только лица, специально
          уполномоченные на проведение работ, указанных в пункте 2 настоящего уведомления и предупрежденные об
          ответственности за случайное или умышленное разглашение либо несанкционированное использование таких
          сведений.<br />
          4. Персональные данные пользователей информации хранятся и обрабатываются с соблюдением требований
          российского законодательства.<br />
          5. Какая-либо информация, являющаяся производной по отношению к сведениям, перечисленным в пункте 1
          настоящего уведомления, представляется для последующего использования (распространения) исключительно в
          обобщенном виде, без указания конкретных сетевых адресов и доменных имен пользователей информации.<br />
          6. Рассылка каких-либо электронных сообщений по сетевым адресам пользователей информации, а также размещение
          на Сайте гиперссылок на сетевые адреса пользователей информации и (или) их интернет-страницы допускаются
          исключительно, если такая рассылка и (или) размещение прямо предусмотрены правилами использования
          соответствующего интерактивного сервиса и на такую рассылку и (или) размещение получено предварительное
          согласие пользователя информации. Переписка с пользователями информации, не относящаяся к использованию
          интерактивных сервисов Сайта либо иных информационных разделов Сайта, не производится.<br /><br />

          <b>Уведомление об использовании файлов cookie, «Яндекс.Метрики»</b><br />
          Сайт использует файлы cookie для повышения удобства пользователей, улучшения работы сайта и анализа
          поведения посетителей. Также на сайте применяются средства веб-аналитики «Яндекс.Метрика» для сбора
          статистических сведений об использовании сайта.<br />
          Сервис «Яндекс.Метрика» собирает следующие данные:<br />
          IP-адрес пользователя на момент посещения сайта;<br />
          тип и версия браузера;<br />
          тип устройства и операционная система;<br />
          разрешение экрана;<br />
          источник перехода на сайт (поисковая система, рекламное объявление и т.п.);<br />
          действия пользователя на сайте (просмотренные страницы, клики, скроллы, длительность визита и др.);<br />
          файлы cookie и уникальные идентификаторы.<br />
          Эти данные не позволяют идентифицировать личность пользователя и используются исключительно в обезличенной
          форме для анализа посещаемости, выявления технических ошибок и улучшения пользовательского опыта. Обработка
          осуществляется в соответствии с Политикой конфиденциальности Яндекса.<br />
          Я уведомлен(а), что возможности Яндекса по использованию и передаче третьим лицам сведений, собранных
          средством «Яндекс.Метрики», ограничиваются Политикой конфиденциальности Яндекса, а также о возможности
          запретить «Яндекс.Метрике» узнавать меня при повторных посещениях данного Сайта, отключив cookie-файлы
          «Яндекс.Метрики» в своём браузере.<br />
          Я также уведомлён(а) о возможности ограничить сбор такой информации, отключив cookie-файлы в настройках
          своего браузера.<br />
          Большинство интернет-браузеров изначально настроены на автоматический прием файлов cookie. Если пользователь
          не согласен на использование данного типа файлов, он должен соответствующим образом установить настройки
          браузера.

        </div>
        <a href="javascript:void(0)" class="arrow-btn__dark cookie-agreed modal-close" style="margin-top: 15px; padding:5px 10px 5px 10px"  class="modal-close">
          <span>
            Понятно
          </span>
        </a>
      </div>
      <button type="button" class="modal-close">
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M11.75 11.75L22.75 22.75M0.75 22.75L11.75 11.75L0.75 22.75ZM22.75 0.75L11.75 11.75L22.75 0.75ZM11.75 11.75L0.75 0.75L11.75 11.75Z"
            stroke="#21272A" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
        </svg>
      </button>
    </div>
  </div>
  <div class="overlay"></div>
  <div class="modal" id="presentation">
    <div class="modal-inner">
      <? $APPLICATION->IncludeComponent(
        "bitrix:form.result.new",
        "modal",
        array(
          "AJAX_MODE" => "Y",
          "AJAX_OPTION_SHADOW" => "N",
          "AJAX_OPTION_JUMP" => "N",
          "AJAX_OPTION_STYLE" => "Y",
          "AJAX_OPTION_HISTORY" => "N",
          "CACHE_TIME" => "3600000",  // Время кеширования (сек.)
          "CACHE_TYPE" => "A",  // Тип кеширования
          "CHAIN_ITEM_LINK" => "",  // Ссылка на дополнительном пункте в навигационной цепочке
          "CHAIN_ITEM_TEXT" => "",  // Название дополнительного пункта в навигационной цепочке
          "EDIT_URL" => "",  // Страница редактирования результата
          "IGNORE_CUSTOM_TEMPLATE" => "N",  // Игнорировать свой шаблон
          "LIST_URL" => "",  // Страница со списком результатов
          "SEF_MODE" => "N",  // Включить поддержку ЧПУ
          "SUCCESS_URL" => "",  // Страница с сообщением об успешной отправке
          "USE_EXTENDED_ERRORS" => "Y",  // Использовать расширенный вывод сообщений об ошибках
          "VARIABLE_ALIASES" => array(
            "RESULT_ID" => "",
            "WEB_FORM_ID" => "",
          ),
          "WEB_FORM_ID" => "3",  // ID веб-формы
          "UNIQUE_PREFIX" => "presentation_form"
        ),
        false
      ); ?>
    </div>
  </div>
  <div class="modal" id="estimate">
    <div class="modal-inner">
      <? $APPLICATION->IncludeComponent(
        "bitrix:form.result.new",
        "modal",
        array(
          "AJAX_MODE" => "Y",
          "AJAX_OPTION_SHADOW" => "N",
          "AJAX_OPTION_JUMP" => "N",
          "AJAX_OPTION_STYLE" => "Y",
          "AJAX_OPTION_HISTORY" => "N",
          "CACHE_TIME" => "3600000",  // Время кеширования (сек.)
          "CACHE_TYPE" => "A",  // Тип кеширования
          "CHAIN_ITEM_LINK" => "",  // Ссылка на дополнительном пункте в навигационной цепочке
          "CHAIN_ITEM_TEXT" => "",  // Название дополнительного пункта в навигационной цепочке
          "EDIT_URL" => "",  // Страница редактирования результата
          "IGNORE_CUSTOM_TEMPLATE" => "N",  // Игнорировать свой шаблон
          "LIST_URL" => "",  // Страница со списком результатов
          "SEF_MODE" => "N",  // Включить поддержку ЧПУ
          "SUCCESS_URL" => "",  // Страница с сообщением об успешной отправке
          "USE_EXTENDED_ERRORS" => "Y",  // Использовать расширенный вывод сообщений об ошибках
          "VARIABLE_ALIASES" => array(
            "RESULT_ID" => "",
            "WEB_FORM_ID" => "",
          ),
          "WEB_FORM_ID" => "2",  // ID веб-формы
          "UNIQUE_PREFIX" => "estimate_form"
        ),
        false
      ); ?>
    </div>
  </div>
  <div class="modal" id="manager">
    <div class="modal-inner">
      <? $APPLICATION->IncludeComponent(
        "bitrix:form.result.new",
        "modal",
        array(
          "AJAX_MODE" => "Y",
          "AJAX_OPTION_SHADOW" => "N",
          "AJAX_OPTION_JUMP" => "N",
          "AJAX_OPTION_STYLE" => "Y",
          "AJAX_OPTION_HISTORY" => "N",
          "CACHE_TIME" => "3600000",  // Время кеширования (сек.)
          "CACHE_TYPE" => "A",  // Тип кеширования
          "CHAIN_ITEM_LINK" => "",  // Ссылка на дополнительном пункте в навигационной цепочке
          "CHAIN_ITEM_TEXT" => "",  // Название дополнительного пункта в навигационной цепочке
          "EDIT_URL" => "",  // Страница редактирования результата
          "IGNORE_CUSTOM_TEMPLATE" => "N",  // Игнорировать свой шаблон
          "LIST_URL" => "",  // Страница со списком результатов
          "SEF_MODE" => "N",  // Включить поддержку ЧПУ
          "SUCCESS_URL" => "",  // Страница с сообщением об успешной отправке
          "USE_EXTENDED_ERRORS" => "Y",  // Использовать расширенный вывод сообщений об ошибках
          "VARIABLE_ALIASES" => array(
            "RESULT_ID" => "",
            "WEB_FORM_ID" => "",
          ),
          "WEB_FORM_ID" => "1",  // ID веб-формы
          "UNIQUE_PREFIX" => "modal_form"
        ),
        false
      ); ?>
    </div>
  </div>

  <div class="container">
    <div class="footer-inner">
      <div class="footer-top">
        <div class="footer-left">
          <a href="javascript:void(0)" class="footer-logo">
            <img src="<?= SITE_TEMPLATE_PATH ?>/assets/img/logo.svg" alt="img">
          </a>
          <? $APPLICATION->IncludeComponent(
            "bitrix:highloadblock.list",
            "socials",
            array(
              "BLOCK_ID" => HL_SOCIAL_NETWORKS_ID,  // ID highload блока
              "CHECK_PERMISSIONS" => "N",  // Проверять права доступа
              "DETAIL_URL" => "",  // Путь к странице просмотра записи
              "FILTER_NAME" => "",  // Идентификатор фильтра
              "PAGEN_ID" => "",  // Идентификатор страницы
              "ROWS_PER_PAGE" => "",  // Разбить по страницам количеством
              "SORT_FIELD" => "ID",  // Поле сортировки
              "SORT_ORDER" => "ASC",  // Направление сортировки
            ),
            false
          ); ?>
        </div>
        <ul class="footer-items">

          <? $APPLICATION->IncludeComponent(
            "bitrix:menu",
            "footer_menu",
            array(
              "ROOT_MENU_TYPE" => "bottom_projects",  // Тип меню для первого уровня
              "MAX_LEVEL" => "1",  // Уровень вложенности меню
              "CHILD_MENU_TYPE" => "",  // Тип меню для остальных уровней
              "USE_EXT" => "N",  // Подключать файлы с именами вида .тип_меню.menu_ext.php
              "DELAY" => "N",  // Откладывать выполнение шаблона меню
              "ALLOW_MULTI_SELECT" => "Y",  // Разрешить несколько активных пунктов одновременно
              "MENU_CACHE_TYPE" => "N",  // Тип кеширования
              "MENU_CACHE_TIME" => "3600",  // Время кеширования (сек.)
              "MENU_CACHE_USE_GROUPS" => "Y",  // Учитывать права доступа
              "MENU_CACHE_GET_VARS" => "",  // Значимые переменные запроса
              "COMPONENT_TEMPLATE" => "",
              "MENU_TITLE" => "Проекты домов"
            ),
            false
          ); ?>

          <? $APPLICATION->IncludeComponent(
            "bitrix:menu",
            "footer_menu",
            array(
              "ROOT_MENU_TYPE" => "bottom_portfolio",  // Тип меню для первого уровня
              "MAX_LEVEL" => "1",  // Уровень вложенности меню
              "CHILD_MENU_TYPE" => "",  // Тип меню для остальных уровней
              "USE_EXT" => "N",  // Подключать файлы с именами вида .тип_меню.menu_ext.php
              "DELAY" => "N",  // Откладывать выполнение шаблона меню
              "ALLOW_MULTI_SELECT" => "Y",  // Разрешить несколько активных пунктов одновременно
              "MENU_CACHE_TYPE" => "N",  // Тип кеширования
              "MENU_CACHE_TIME" => "3600",  // Время кеширования (сек.)
              "MENU_CACHE_USE_GROUPS" => "Y",  // Учитывать права доступа
              "MENU_CACHE_GET_VARS" => "",  // Значимые переменные запроса
              "COMPONENT_TEMPLATE" => "",
              "MENU_TITLE" => "Портфолио проектов"
            ),
            false
          ); ?>


          <? $APPLICATION->IncludeComponent(
            "bitrix:menu",
            "footer_menu",
            array(
              "ROOT_MENU_TYPE" => "bottom_company",  // Тип меню для первого уровня
              "MAX_LEVEL" => "1",  // Уровень вложенности меню
              "CHILD_MENU_TYPE" => "",  // Тип меню для остальных уровней
              "USE_EXT" => "N",  // Подключать файлы с именами вида .тип_меню.menu_ext.php
              "DELAY" => "N",  // Откладывать выполнение шаблона меню
              "ALLOW_MULTI_SELECT" => "Y",  // Разрешить несколько активных пунктов одновременно
              "MENU_CACHE_TYPE" => "N",  // Тип кеширования
              "MENU_CACHE_TIME" => "3600",  // Время кеширования (сек.)
              "MENU_CACHE_USE_GROUPS" => "Y",  // Учитывать права доступа
              "MENU_CACHE_GET_VARS" => "",  // Значимые переменные запроса
              "COMPONENT_TEMPLATE" => "",
              "MENU_TITLE" => "О компании"
            ),
            false
          ); ?>


          <? $APPLICATION->IncludeComponent(
            "bitrix:menu",
            "footer_menu",
            array(
              "ROOT_MENU_TYPE" => "bottom_dop",  // Тип меню для первого уровня
              "MAX_LEVEL" => "1",  // Уровень вложенности меню
              "CHILD_MENU_TYPE" => "",  // Тип меню для остальных уровней
              "USE_EXT" => "N",  // Подключать файлы с именами вида .тип_меню.menu_ext.php
              "DELAY" => "N",  // Откладывать выполнение шаблона меню
              "ALLOW_MULTI_SELECT" => "Y",  // Разрешить несколько активных пунктов одновременно
              "MENU_CACHE_TYPE" => "N",  // Тип кеширования
              "MENU_CACHE_TIME" => "3600",  // Время кеширования (сек.)
              "MENU_CACHE_USE_GROUPS" => "Y",  // Учитывать права доступа
              "MENU_CACHE_GET_VARS" => "",  // Значимые переменные запроса
              "COMPONENT_TEMPLATE" => "",
              "MENU_TITLE" => "Дополнительно"
            ),
            false
          ); ?>

          <li class="footer-item">
            <? $APPLICATION->IncludeComponent(
              "bitrix:main.include",
              "",
              array(
                "AREA_FILE_SHOW" => "file",
                "AREA_FILE_SUFFIX" => "",
                "EDIT_TEMPLATE" => "standard.php",
                "PATH" => "/include/general/footer/footer_contacts.php"
              )
            ); ?>
          </li>
        </ul>
      </div>
      <div class="footer-devider"></div>
      <div class="footer-copy">
        <div class="copyright">
          ©2025 10 Домов. Все права защищены.
        </div>
        <div class="footer-reqs">
          <div class="footer-reqs__item">
            ООО «10 ДОМОВ»
          </div>
          <div class="footer-reqs__item">
            ИНН 5017142429
          </div>
          <div class="footer-reqs__item">
            КПП 501701001
          </div>
          <div class="footer-reqs__item">
            ОГРН 1255000090003
          </div>
        </div>
      </div>
      <div class="footer-decor">
        <img src="<?= SITE_TEMPLATE_PATH ?>/assets/img/f-logo-decor.svg" alt="img">
      </div>
    </div>
  </div>
</footer>
</body>

</html>